modules/xmlread/models/Xmlread.php

    public static function All() {
        return (new Query)
                        ->select('Name, Kod')
                        ->from('OKPD')
                        ->orderBy('kod')
                        ->where(['SubKod2' => NULL])
                        ->all();
---
SELECT `Name`, `Kod` FROM `OKPD` WHERE `SubKod2` IS NULL ORDER BY `kod`

    public static function searchAll(string $search) {
        $query = (new Query)
                ->select('Name, Kod')
                ->from('OKPD')
                ->where(['like', 'Name', ['search' => trim($search)]])
                ->limit(20)
                ->all();
---
SELECT `Name`, `Kod` FROM `OKPD` WHERE `Name` LIKE '%п%' LIMIT 20