modules/login/models/Users.php

SELECT * FROM `users` WHERE `id`=1
---
    public static function findIdentity($id) {
        return self::findOne($id);